api/modules/v1/controllers/PaymentController.php

    public function behaviors()
    {
        $behaviors = parent::behaviors();
        $behaviors['authenticator'] = [
            'class' => HttpBasicAuth::class,
            'auth' => function ($username, $password) {
            /** @var User $user */
                $user = User::find()->where(['username' => $username])->one();
---
SELECT * FROM `user` WHERE `username`='admin'