api/modules/v1/entities/Transaction.php

SELECT EXISTS(SELECT * FROM `api_transactions` WHERE (`external_id`=24) AND (`api_user_id`=1))
---
    public static function checkForExist($external_id)
    {
        $api_user_id = \Yii::$app->user->id;
        return Transaction::find()->where([
            'external_id' => $external_id,
            'api_user_id' => $api_user_id,
        ])->exists();